#Generated by Fabric Compiler ( version 2018.2B <build 38177> ) at Wed Mar 13 09:59:19 2019

add_design -verilog "D:/example_ziguang/hdmi_test/source/source/color_bar.v"
add_design -verilog "D:/example_ziguang/hdmi_test/source/source/top.v"
add_design -verilog "D:/example_ziguang/hdmi_test/source/source/video_define.v"
add_design D:/example_ziguang/hdmi_test/ipcore/video_pll/inst.idf
add_design -verilog "D:/example_ziguang/hdmi_test/source/dvi_tx/dvi_encoder.v"
add_design -verilog "D:/example_ziguang/hdmi_test/source/dvi_tx/encode.v"
add_design -verilog "D:/example_ziguang/hdmi_test/source/dvi_tx/serdes_4b_10to1.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
add_constraint -logic -fdc "D:/example_ziguang/hdmi_test/hdmi_test.fdc"
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr 
report_timing -configuration 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr 
report_timing -configuration 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr 
report_timing -configuration 
gen_bit_stream 
add_design -verilog "D:/example_ziguang/hdmi_test _char/source/src/osd_display.v"
add_design -verilog "D:/example_ziguang/hdmi_test _char/source/src/timing_gen_xy.v"
add_design D:/example_ziguang/hdmi_test _char/ipcore/osd_rom/inst.idf
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_design D:/example_ziguang/hdmi_test _char/ipcore/osd_rom/inst.idf
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
add_design D:/example_ziguang/hdmi_test _char/source/osd_rom/inst.idf
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr 
report_timing 
gen_bit_stream 
pnr -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
pnr -plc_decongestion 2 -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
remove_design D:/example_ziguang/hdmi_test _char/source/osd_rom/inst.idf
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
add_design D:/example_ziguang/hdmi_test _char/source/ipcore/osd_rom/inst.idf
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -plc_decongestion 2 -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -plc_decongestion 2 -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -plc_decongestion 2 -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -plc_decongestion 2 -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
add_design D:/example_ziguang/hdmi_test _char/source/hdmi_test _char/ipcore/osd_rom/inst.idf
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -plc_decongestion 2 -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
report_power 
gen_bit_stream 
pnr -plc_decongestion 2 -fast_router false -fix_hold_violation 
report_timing 
report_power 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
remove_design D:/example_ziguang/hdmi_test _char/source/hdmi_test _char/ipcore/osd_rom/inst.idf
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -plc_decongestion 2 -fast_router false -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -plc_decongestion 2 -fast_router false -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -plc_decongestion 2 -fast_router false -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -plc_decongestion 2 -fast_router false -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -plc_decongestion 2 -fast_router false -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -plc_decongestion 2 -fast_router false -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -plc_decongestion 2 -fast_router false -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -plc_decongestion 2 -fast_router false -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -plc_decongestion 2 -fast_router false -fix_hold_violation 
report_timing 
gen_bit_stream 
remove_design D:/example_ziguang/hdmi_test _char/source/ipcore/osd_rom/inst.idf
add_design D:/example_ziguang/hdmi_test _char/source/example_ziguang/hdmi_test _char/ipcore/osd_rom/inst.idf
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -plc_decongestion 2 -fast_router false -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -plc_decongestion 2 -fast_router false -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -plc_decongestion 2 -fast_router false -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -plc_decongestion 2 -fast_router false -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -plc_decongestion 2 -fast_router false -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -plc_decongestion 2 -fast_router false -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -optimize_multi_corner_timing -fix_hold_violation 
report_timing 
gen_bit_stream 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream 
add_fic "D:/example_ziguang/hdmi_test _char/synthesize/top.fic"
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
dev_map 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
remove_fic "I:/example_ziguang/demo/12_1_hdmi_test _char/synthesize/top.fic"
set_arch -family Logos -device PGL22G -speedgrade -6 -package BG324
synthesize -synplify_pro 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
add_design "D:/PDS/PGL22G/CD_20210223/CD_20210223/demo/12_1_hdmi_test _char/source/source/average.v"
add_design "D:/PDS/PGL22G/CD_20210223/CD_20210223/demo/12_1_hdmi_test _char/source/source/RGB_Control1.v"
add_design "D:/PDS/PGL22G/CD_20210223/CD_20210223/demo/12_1_hdmi_test _char/source/source/RZ_Code.v"
add_design "D:/PDS/PGL22G/CD_20210223/CD_20210223/demo/12_1_hdmi_test _char/source/source/uart_recv.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
add_simulation "D:/desktop/Plan/ZiGuang/source/tb_hdmi_colorbar_top.v"
add_simulation "D:/desktop/Plan/ZiGuang/source/RZ_Code_tb.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
add_simulation "D:/desktop/Plan/ZiGuang/source/uart_recv_tb.v"
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
